//=============================================================================
//
// ライト処理 [light.h]
// Author : HIROHIKO HAMAYA
//
//=============================================================================
#pragma once

#include "main.h"
#include "FbxModel.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitLight(void);
void UninitLight(void);
void UpdateLight(void);

CFbxLight& GetLight(void);
