//*****************************************************************************
// SceneManager.h
//*****************************************************************************
#pragma once
#include "main.h"

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
HRESULT InitScene();
void UpdateScene();
void ChangeScene();
void DrawScene();
void EndScene();
void TransitionForNewScene(bool bTransitionIn);