//*****************************************************************************
// TransitionControl.h
//*****************************************************************************
#pragma once

//*****************************************************************************
// エナム
//*****************************************************************************
enum TRANSITIONS
{
	STICKER_TRANSITION,
	SLASH_TRANSITION,
	TRANSITION_NONE
};

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
namespace TransitionControl
{
	void Init();
	void Update();
	void Draw();
	void End();
}
void SetTransition(bool TransitionIn, int TransitionType);
bool IsTransitionComplete();